[Akimbo X2SoldierClassTemplate]
+DisplayName="Akimbo"
+ClassSummary="Akimbo makes use of dual single-handed firearms to engage enemies at close and medium range, and can specialize in gunplay and avoidance, or surprising enemies with a barrage of melee attacks."
+LeftAbilityTreeTitle="Gun Fu"
+RightAbilityTreeTitle="Scrapper"
AbilityTreeTitles[0]="Gun Fu"
AbilityTreeTitles[1]="Scrapper"
AbilityTreeTitles[2]="Supplemental"

+RandomNickNames[0]="Shooter"
+RandomNickNames[1]="Trick Shot"
+RandomNickNames[2]="Six Gun"
+RandomNickNames[3]="Ranger"
+RandomNickNames[4]="Buffalo"
+RandomNickNames[5]="Ace"
+RandomNickNames[6]="Texas"
+RandomNickNames[7]="Fast"
+RandomNickNames[8]="Lucky"
+RandomNickNames[9]="Two Guns"
+RandomNickNames[10]="Stand Off"
+RandomNickNames[11]="High Noon"
+RandomNickNames[12]="Cowboy"
+RandomNickNames[13]="Mason"
+RandomNickNames[14]="Bullet Wizard"
+RandomNickNames[15]="Smith'n'Wesson"
+RandomNickNames[16]="Trigger"
+RandomNickNames[17]="Wild West"
+RandomNickNames[18]="Macedonian"
+RandomNickNames[19]="Forty Seven"
+RandomNickNames[20]="Wick"
+RandomNickNames[21]="Gunfall"
+RandomNickNames[22]="Gun Show"

;//SQUADDIE PERKS
;///LocHelpText - shown in tactical under ability name
;///LocLongDescription - shown in strategic at the bottom, and on mouseover on corner icon in tactical

[DP_SingleShotRight X2AbilityTemplate]
LocFriendlyName="Single Shot (Right)"
LocHelpText="Fire a carefully aimed shot with bonus critical chance."

[DP_SingleShotLeft X2AbilityTemplate]
LocFriendlyName="Single Shot (Left)"
LocHelpText="Fire a carefully aimed shot with bonus critical chance."

[DP_DualPistols X2AbilityTemplate]
LocFriendlyName="Dual Weapon Specialization"
LocLongDescription="This soldier has underwent special training and can equip two pistols at the same time."
LocPromotionPopupText="<Bullet/>Each Akimbo shot counts as a separate attack from a separate weapon. Each shot will use a separate aim roll, and will be affected by attachments applied only to that specific weapon. <br/><Bullet/>Activating Dual Overwatch grants two Overwatch Action Points. Each can be spent on one reaction shot from one weapon. These reaction shots are completely independent; they can trigger against different enemies, or against the same one. This allows Dual Overwatch to be effective against multiple weak targets, but it's less reliable when it comes to dealing damage to one enemy.<br/><Bullet/>Overwatch Pacer: the enemy has to run several tiles, activate several actions, or attack the Akimbo, before another reaction shot can be triggered.<br/><Bullet/>Specialists' Threat Assessment grants Akimbo one Overwatch Action Point, but no Covering Fire."

[DP_DualShot X2AbilityTemplate]
LocFriendlyName="Dual Shot"
LocLongDescription="Fire both weapons at a single enemy."
LocHelpText="Fire both weapons at a single enemy."
LocFlyOverText="Dual Shot"

[DP_DualOverwatch X2AbilityTemplate]
LocFriendlyName="Dual Overwatch"
LocFriendlyNameWhenConcealed="Dual Overwatch (Concealed)"
LocLongDescription="During enemy turn, fire single shots at enemies that move in your line of sight, with a penalty to aim."
LocLongDescriptionWhenConcealed="If revealed, fire single shots at enemies moving within your line of sight."
LocHelpText="During enemy turn, fire single shots at enemies that move in your line of sight, with a penalty to aim."
LocFlyOverText="Dual Overwatch"

;//GUN FU PERKS

[DP_TrickShot X2AbilityTemplate]
LocFriendlyName="Trick Shot"
LocLongDescription="Fire a shot near enemy's cover, and fire another shot to correct the first bullet's trajectory mid flight, delivering a surprise hit."
LocHelpText="Deliver a flanking shot from the mainhand weapon against a target in cover."
LocFlyOverText="Trick Shot" 
LocPromotionPopupText="<Bullet/>Trick Shot ignores cover defense bonuses.<br/><Bullet/>Costs 2 ammo, but deals damage only from the mainahnd weapon.<br/><Bullet/>This ability benefits from Hunter's Instinct and provides the same crit chance as an actual flanking shot would.<br/><Bullet/>No cooldown.<br/>"

[DP_BulletTime X2AbilityTemplate]
LocFriendlyName="Bullet Time"
LocLongDescription="Dual Shot, Single Shot (Last One), Trick Shot, Leg Shot and Checkmate no longer end turn."
LocFlyOverText="Bullet Time"

[DP_GunKata_Active X2AbilityTemplate]
LocFriendlyName="Gun Kata"
LocLongDescription="Replaces Overwatch. Grants four Overwatch Action Points. Allows Overwatch Action Points to be used on completely avoiding enemy shots and pre-emptive return fire reaction shots."
LocHelpText="Grants four Overwatch Action Points, which are automatically spent on reaction shots and avoiding enemy fire."
LocFlyOverText="Gun Kata" 
LocPromotionPopupText="Gun Kata works like a supercharged Dual Overwatch. As long as the soldier has Gun Kata ability, any Overwatch Action Point can be spent on:<br/><Bullet/>Gun Kata Dodge: enemy hits will be automatically converted into misses. Action Point cost is not applied if the shot would have missed anyway.<br/><Bullet/>Gun Kata Return Fire: an automatic reaction shot against an enemy that attacks the soldier. Return Fire triggers before enemy attack."

[GunKata_Passive X2AbilityTemplate]
LocFriendlyName="Gun Kata"
LocHelpText="Overwatch Action Points can be used to dodge enemy shot and return fire."
LocFlyOverText="Gun Kata"

[DP_SpinningReload_Active X2AbilityTemplate]
LocFriendlyName="Spinning Reload"
LocLongDescription="Replaces normal Reload. Reloads your weapons and grants one Overwatch Action Point. Additionally, this ability passively enables the soldier to spend Overwatch Action Points on automatic reloads during enemy turn."
LocHelpText="Reload your weapons and gain one Overwatch Action Point."
LocFlyOverText="Spinning Reload" 

[DP_SpinningReload_Passive X2AbilityTemplate]
LocFriendlyName="Spinning Reload"
LocLongDescription="Replaces normal Reload. Reloads your weapons and grants one Overwatch Action Point. Additionally, this ability passively enables the soldier to spend Overwatch Action Points on automatic reloads during enemy turn."
LocHelpText="Reload automatically at the cost of Overwatch Action Points."
LocPromotionPopupText="Spinning Reload has two components, Active and Reactive.<br/><Bullet/>Active Spinning Reload can be used during your turn, just like normal Reload.<br/><Bullet/>If the soldier doesn't have Quicksilver, Spinning Reload can be used even at full ammo - just to gain an Overwatch Action Point without ending turn.<br/><Bullet/>Reactive Spinning Reload triggers automatically during enemy turn at the cost of one Overwatch Action Point. Reactive Spinning Reload will trigger if the soldier hits 0 ammo.<br/><Bullet/>It has same triggers as a reaction shot and obeys Overwatch Pacer.<br/><Bullet/>Spinning Reload will also automatically trigger if you ended your turn with no ammo.<br/><Bullet/>It will also trigger at the beginning of your next turn, if you have at least one Overwatch Action Point remaining.<br/><Bullet/>If you have only one Overwatch Action Point, Reactive Spinning Reload will not consume it until the beginning of your turn in case you will need that Action Point to dodge an enemy attack."

[DP_Quicksilver X2AbilityTemplate]
LocFriendlyName="Quicksilver"
LocLongDescription="Gun Kata and Dual Overwatch no longer end turn. Additionally, reaction shots have +10 Aim and can crit."
LocPromotionPopupText="If you're using this ability with Musashi's RPG Overhaul, then be aware that regular Overwatch will still end turn."

[DP_Unload X2AbilityTemplate]
LocFriendlyName="Unload"
LocLongDescription="Fire each weapon 3 times at a single target. Costs 6 ammo, 3 turn cooldown."
LocHelpText="Fire each weapon 3 times at a single target. 3 turn cooldown."
LocFlyOverText="Unload"

;//SCRAPPER PERKS

[DP_PistolWhip X2AbilityTemplate]
LocFriendlyName="Pistol Whip"
LocLongDescription="Move to an enemy and strike with both weapons. This ability also provides a passive +20 Aim bonus to ALL melee attacks."
LocHelpText="Move to an enemy and strike with both weapons."
LocFlyOverText="Pistol Whip"
LocPromotionPopupText="<Bullet/>Pistol Whip deals normal weapon damage, but it does not gain a critical chance bonus for flanking or bonus effects from special ammo.<br/><Bullet/>Each weapon strike uses a separate aim roll."

[DP_BonusMeleeAim X2AbilityTemplate]
LocFriendlyName="Pistol Whip"
LocLongDescription="Passive +20 Aim bonus to ALL melee attacks with dual one-handed firearms."
LocHelpText"Passive +20 Aim bonus to ALL melee attacks with dual one-handed firearms."

[DP_TakeInitiative X2AbilityTemplate]
LocFriendlyName="Take Initiative"
LocLongDescription="After attacking an enemy with Pistol Whip, immediately trigger an additional dual melee reaction attack against every enemy in melee range, including the original target."
LocFlyOverText="Take Initiative"
LocPromotionPopupText="<Bullet/>Each enemy can trigger one dual melee attack from Take Initiative per turn. <br/><Bullet/>This limit resets at the end of your turn and at the end of enemy turn<br/><Bullet/>This limit applies to attacks from CQC Supremacy.<br/><Bullet/>These attacks count as reaction attacks and will have aim penalties."

[DP_CQCSupremacy X2AbilityTemplate]
LocFriendlyName="CQC Supremacy"
LocLongDescription="Free dual melee attacks against enemies moving or attempting action in melee range."
LocFlyOverText="CQC Supremacy"
LocPromotionPopupText="<Bullet/>Each enemy can trigger one dual melee attack from CQC Supremacy per turn.<br/><Bullet/>This limit resets at the end of your turn and at the end of enemy turn<br/><Bullet/>This limit applies to attacks from Take Initiative."

[DP_ElectrifiedSpikes X2AbilityTemplate]
LocFriendlyName="Electrified Spikes"
LocLongDescription="Repeat melee attacks against the same target have a 75% chance to disorient. Melee attacks against disoriented enemies have a 75% chance to stun. Additionally, melee attacks against disoriented or stunned enemies will shred 1 armor for each hit."
LocFlyOverText="Electrified Spikes"
LocPromotionPopupText="<Bullet/>This effect is applied to the secondary attack of the Pistol Whip.<br/><Bullet/>If you're using this ability with Musashi's RPG Overhaul, then be aware it works ONLY with Akimbo's melee attacks."

[DP_Checkmate X2AbilityTemplate]
LocFriendlyName="Checkmate"
LocLongDescription="A special mainhand shot that deals 300% bonus damage to a stunned, unconscious or panicked enemy at close range. Always hits." 
LocHelpText="A special mainhand shot that deals 300% bonus damage to a stunned, unconscious or panicked enemy at close range. Always hits."
LocFlyOverText="Checkmate"
LocPromotionPopupText="<Bullet/>Can be used only against stunned, unconscious or panicked enemies within 1 tile.<br/><Bullet/>Does not include movement.<br/><Bullet/>Checkmate always hits and always crits.<br/><Bullet/>Costs 1 ammo. No cooldown."

[DP_LimitBreak X2AbilityTemplate]
LocFriendlyName="Limit Break"
LocLongDescription="Allows the soldier to break the shackles of human mind and gain perfect control of the body. Gain unlimited actions until the end of turn. Taking more than 4 actions will make the soldier take immediate damage, equal to 10% of maximum Health. Taking more than 5 actions will have an increasing chance to render the soldier unconscious. Damage from other sources is delayed until the beginning of next turn and amplified by 25%. Can be used once per mission."
LocHelpText="Gain unlimited actions until the end of turn. Prolonged use will damage the soldier and potentially render them unconscious. Damage from other sources is delayed by 1 turn and increased by 25%."
LocFlyOverText="Limit Break"
LocPromotionPopupText="<Bullet/>Limit Break requires at least 1 Action to activate, but it will consume all available Action Points.<br/><Bullet/>After activating Limit Break, the soldier will have unlimited actions until the end of turn. However, for each action after the 4th one, the soldier will immediately take damage equal to 10% of their maximum health.<br/><Bullet/>This self damage will cancel Overwatch.<br/><Bullet/>All damage from all other sources is delayed until the beginning of your next turn and amplified by 25%.<br/><Bullet/>If damage from an attack exceeds soldier's current health, they will still die.<br/><Bullet/>Taking more than 5 actions in a row will have a chance to knock the soldier unconscious. Chance to lose consciousness:<br/><Bullet/>6 Actions: 25%<br/><Bullet/>7 Actions: 50%<br/><Bullet/>8 Actions: 75%<br/><Bullet/>9 Actions: 90%<br/><Bullet/>10 Actions or more: 95%<br/><Bullet/>Note: Mindshield or other similar effects will prevent the soldier from falling Unconscious."

[DP_LimitBreak_SelfDamage X2AbilityTemplate]
LocFlyOverText="Limit Break"

;// SUPPLEMENTAL TREE

[DP_LegShot X2AbilityTemplate]
LocFriendlyName="Leg Shot"
LocLongDescription="A special dual shot that will reduce enemy mobility, and potentially imoobilize them. Deals half damage and cannot crit. Mobility reduction lasts 1 turn."
LocHelpText="A dual shot that immobilizes the target for 1 turn. Deals half damage, cannot crit."
LocFlyOverText="Leg Shot"
LocPromotionPopupText="<Bullet/>Each shot of this ability reduces enemy mobility stat by 10. It will not prevent enemies from teleporting or using grapple.<br/><Bullet/>No cooldown, costs 2 ammo."

[DP_DirtyKick X2AbilityTemplate]
LocFriendlyName="Dirty Kick"
LocLongDescription="Move to an enemy and kick them in a vulnerable spot. If hits, stuns for 3 actions."
LocHelpText="Move to an enemy and kick them in a vulnerable spot. If hits, stuns for 3 actions."
LocFlyOverText="Dirty Kick"
LocPromotionPopupText="<Bullet/>This ability includes movement and counts as a melee attack, but it does not deal any damage, even with Hunter's Instincts.<br/><Bullet/>Cannot be used against large or robotic enemies.<br/><Bullet/>If hits, stuns for 3 actions, meaning that most enemies will spend their next whole turn stunned, and they will have one action on a turn after that.<br/><Bullet/>Costs 1 action and doesn't end turn.<br/><Bullet/>2 turn cooldown."

[DP_HuntersInstinct X2AbilityTemplate]
LocFriendlyName="Hunter's Instinct"
LocLongDescription="Increases ranged damage to flanked enemies by 1. Increases melee damage by 1."
LocFlyOverText="Hunter's Instinct"
LocPromotionPopupText="Bonus damage is applied to each shot and each melee strike. Affects Trick Shot."